In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np
import matplotlib as mpl

from sklearn.model_selection import train_test_split

In [103]:
r_cols = ['user_id', 'movie_id', 'rating', 'timestamp']
ratings = pd.read_csv("ml_1m/ratings.dat", sep='::', names=r_cols)
ratings

         user_id  movie_id  rating  timestamp
0              1      1193       5  978300760
1              1       661       3  978302109
2              1       914       3  978301968
3              1      3408       4  978300275
4              1      2355       5  978824291
...          ...       ...     ...        ...
1000204     6040      1091       1  956716541
1000205     6040      1094       5  956704887
1000206     6040       562       5  956704746
1000207     6040      1096       4  956715648
1000208     6040      1097       4  956715569

[1000209 rows x 4 columns]

In [108]:
x_train_hold = []
x_test_hold = []
for i in range(1,6041):
    df = ratings[ratings.user_id == i]
    df = df.sort_values(by=['timestamp'], ascending=False)
    df.drop('timestamp',axis='columns', inplace=True)
    df = np.array(df)
    if len(df) >= 5:
        for n in range(int(len(df)*0.8)):
            x_train_hold.append(df[n])
        for n in range(int(len(df)*0.2)):
            x_test_hold.append(df[n])

In [109]:
pd.DataFrame(x_test_hold)

           0     1  2
0          1    48  5
1          1  1566  4
2          1  1907  4
3          1  2294  4
4          1  2355  5
...      ...   ... ..
197651  6040  3108  4
197652  6040  1354  4
197653  6040  1244  4
197654  6040  1283  4
197655  6040    32  4

[197656 rows x 3 columns]

In [110]:
pd.DataFrame(x_train_hold)

           0     1  2
0          1    48  5
1          1  1566  4
2          1  1907  4
3          1  2294  4
4          1  2355  5
...      ...   ... ..
797753  6040  2859  4
797754  6040  1296  2
797755  6040  3094  2
797756  6040  3543  4
797757  6040  1225  3

[797758 rows x 3 columns]

In [111]:
len(x_test_hold)+len(x_train_hold)

995414

In [83]:
x_test_hold
np.savetxt('data/ml1m/test/train_test.txt',x_test_hold.astype(int), fmt='%i')

In [52]:
df = ratings[ratings.user_id == 6040]
df

         user_id  movie_id  rating  timestamp
999868      6040       573       4  956704056
999869      6040       589       4  956704996
999870      6040         1       3  957717358
999871      6040      2068       4  997453982
999872      6040       592       2  956716016
...          ...       ...     ...        ...
1000204     6040      1091       1  956716541
1000205     6040      1094       5  956704887
1000206     6040       562       5  956704746
1000207     6040      1096       4  956715648
1000208     6040      1097       4  956715569

[341 rows x 4 columns]

In [56]:
df = ratings[ratings.rating == 1]
df

         user_id  movie_id  rating  timestamp
148            2        21       1  978299839
180            2      3893       1  978299535
205            3      1261       1  978297663
249            4      3527       1  978294008
268            5      2916       1  978245645
...          ...       ...     ...        ...
1000171     6040      3388       1  956716407
1000177     6040      2751       1  956716438
1000185     6040      2794       1  956716438
1000187     6040      2003       1  956716294
1000204     6040      1091       1  956716541

[56174 rows x 4 columns]

In [58]:
ratings

         user_id  movie_id  rating  timestamp
0              1      1193       5  978300760
1              1       661       3  978302109
2              1       914       3  978301968
3              1      3408       4  978300275
4              1      2355       5  978824291
...          ...       ...     ...        ...
1000204     6040      1091       1  956716541
1000205     6040      1094       5  956704887
1000206     6040       562       5  956704746
1000207     6040      1096       4  956715648
1000208     6040      1097       4  956715569

[1000209 rows x 4 columns]

In [34]:
unique = ratings.timestamp.unique()
len(unique)

458455

In [54]:
df

         user_id  movie_id  rating  timestamp
1000042     6040      1221       4  998315055
1000167     6040       161       3  997454486
1000172     6040      1784       3  997454464
999988      6040      1921       4  997454464
1000019     6040      2917       4  997454429
...          ...       ...     ...        ...
1000007     6040      1961       4  956703977
1000192     6040      2019       5  956703977
1000153     6040      2384       4  956703954
999873      6040       593       5  956703954
1000138     6040       858       4  956703932

[341 rows x 4 columns]

In [55]:
for i in range(int(len(df)*0.8)):
    print(df.movie_id[i+999868])

573
589
1
2068
592
593
3016
3017
2070
1419
2076
3039
903
904
908
910
912
913
1449
916
919
920
923
924
2402
2407
2408
3067
930
3068
2410
2411
3070
3072
2421
3083
3089
953
3094
3095
2439
3097
978
2455
2456
2463
994
3418
2471
3421
3422
3424
213
1834
3449
232
235
246
247
2802
3471
260
263
265
1103
1104
290
296
1111
2852
2858
2859
2863
1124
1127
3819
2872
1136
608
1150
2100
2111
1172
1173
1179
649
1185
1188
1189
2134
1193
1196
1198
1199
2146
2147
2150
3101
3108
3111
3134
1537
1554
2503
3168
2512
2513
3182
1587
1594
3504
1900
3505
1912
2571
300
2575
306
3521
3524
1921
2580
1929
318
326
2599
3543
3547
1945
1947
334
17
3552
1952
1954
25
348
29
1960
1961
1962
1963
1965
1966
30
32
34
357
36
39
2915
2917
2919
1974
1975
45
50
373
58
2938
1991
1200
1203
1206
1208
1210
1211
1212
1213
1214
1217
1219
80
1220
1221
1222
1225
1228
1230
1231
2973
1235
1237
1240
1242
1244
2985
1246
1247
2987
1248
1249
2989
1250
1251
1252
1253
720
1254
722
2997
1258
1259
1263
1264
1265
1270
1273
1276
1278
1280
1283
750
1285
1288
759
1291
1293
1294
1295
1296
1299
2241
2248
778
3201
1617
3224
2286
2289
1633
1635
1641
1649
3262
1663
2612
1673
1674
2624
3289
1694
1699
2641
2645
2648
2664
2692
446
448
457
3671
3683
1300
1305
1307
495
1321
1333
800
1354
1358
2300
2301
2303
2312
1373
1374
1376
2324
858
1392

In [ ]:
df = np.array(ratings.drop('timestamp',axis='columns', inplace=True))

In [ ]:
ratings = np.array(ratings)
ratings

In [ ]:
for i in range(len(ratings)):
    ratings[i][2] = 1

In [ ]:
ratings

In [ ]:
x_train_hold, x_test_hold = train_test_split(ratings, test_size=0.2, random_state=42)

In [ ]:
from sklearn.model_selection import ShuffleSplit
k = 10
test_size = 0.2
random_state = 42
kf = ShuffleSplit(n_splits=k, test_size=test_size, random_state=random_state)

kf.get_n_splits(ratings)

In [ ]:
for train_index, test_index in kf.split(ratings):
            x_train_CV, x_test_CV = ratings[train_index], ratings[test_index]

In [ ]:
for train_index, test_index in kf.split(x_train_CV):
            y_train_CV, y_test_CV = ratings[train_index], ratings[test_index]

In [ ]:
np.savetxt('data/ml1m/test/train_CV.txt',x_train_CV.astype(int), fmt='%i')  
np.savetxt('data/ml1m/test/test_CV.txt',x_test_CV.astype(int), fmt='%i')
np.savetxt('data/ml1m/validation/valid_train_CV.txt',y_train_CV.astype(int), fmt='%i')
np.savetxt('data/ml1m/validation/valid_test_CV.txt',x_test_CV.astype(int), fmt='%i')
np.savetxt('data/ml1m/test/train_hold.txt',x_train_hold.astype(int), fmt='%i')  
np.savetxt('data/ml1m/test/test_hold.txt',x_test_hold.astype(int), fmt='%i')

In [ ]:
x_test_hold

In [ ]:
np.savetxt('data/ml1m/test/train_test.txt',x_train_CV.astype(int), fmt='%i')